---
type: EnergyAnalysisSurface
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 22
tags: [revit-api, class]
---

# EnergyAnalysisSurface

`Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface` · Revit 2024 · 22 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAdjacentAnalyticalSpace | 2012 | `public EnergyAnalysisSpace GetAdjacentAnalyticalSpace ()` |
| Method | GetAnalyticalOpenings | 2012 | `public IList < EnergyAnalysisOpening > GetAnalyticalOpenings ()` |
| Method | GetAnalyticalSpace | 2012 | `public EnergyAnalysisSpace GetAnalyticalSpace ()` |
| Method | GetConstruction | 2024 | `public EnergyAnalysisConstruction GetConstruction ()` |
| Method | GetPolyloop | 2012 | `public Polyloop GetPolyloop ()` |
| Method | GetPolyloops | 2023 | `public IList < Polyloop > GetPolyloops ()` |
| Property | Azimuth | 2012 | `public double Azimuth { get ; }` |
| Property | CADLinkUniqueId | 2012 | `public string CADLinkUniqueId { get ; }` |
| Property | CADObjectUniqueId | 2012 | `public string CADObjectUniqueId { get ; }` |
| Property | Corner | 2012 | `public XYZ Corner { get ; }` |
| Property | Height | 2012 | `public double Height { get ; }` |
| Property | Normal | 2012 | `public XYZ Normal { get ; }` |
| Property | OriginatingElementDescription | 2012 | `public string OriginatingElementDescription { get ; }` |
| Property | OriginatingElementId | 2024 | `public LinkElementId OriginatingElementId { get ; }` |
| Property | OriginatingElementName | 2024 | `public string OriginatingElementName { get ; }` |
| Property | Parameter | — | `` |
| Property | SurfaceId | 2012 | `public string SurfaceId { get ; }` |
| Property | SurfaceName | 2012 | `public string SurfaceName { get ; }` |
| Property | SurfaceType | 2012 | `public EnergyAnalysisSurfaceType SurfaceType { get ; }` |
| Property | Tilt | 2012 | `public double Tilt { get ; }` |
| Property | Type | 2012 | `public gbXMLSurfaceType Type { get ; }` |
| Property | Width | 2012 | `public double Width { get ; }` |